/**
构造函数的分类和调用---根据上节课构造函数的参数的不同来进行构造函数的分类
1.两种分类方式
  按参数分:有参构造和无参构造
  按类型分:普通构造和拷贝构造
2.三种调用方式
  括号法
  显示法
  隐式转换法
**/


#include "iostream"
using namespace std;
/**1.构造函数分类(基于构造函数可以有形参)**/
//  按参数分:无参构造(默认构造) 有参构造
//  按类型分:普通构造 拷贝构造     无参/有参构造都属于普通构造
class Person
{
public:
//无参/有参构造都属于普通构造
    Person()//无参构造
    {
        cout<< "Person构造函数的无参构造(默认构造)方法:Person()"<<endl;
    }
    Person( int a)//有参构造(默认构造)
    {
        age = a;
        cout<< "Person构造函数的有参构造方法:Person( int a)"<<endl;
    }
//拷贝构造：将传入的对象的所有属性拷贝到调用拷贝构造的对象身上
    Person(const Person &p) //为防止传入的函数值被改变 const只读    &p指针传入减少内存使用
    {
        cout<< "Person拷贝构造函数:Person(const Person &p)"<<endl;
        age = p.age; //
    }

    //析构函数
    ~Person()
    {
        cout<< "~Person析构函数会自动调用一次，起到对象销毁的作用"<<endl;
    }
public:
    int age;
};



/**2.三种调用方式**/
//  括号法
//  显示法
//  隐式转换法
void test01()
{
//1.括号法
   cout<<"\r\n\r\n括号法调用:"<<endl;
   Person p1;  //调用默认构造(无参构造)  调用默认构造函数不用写括号
   Person p2(10);//调用有参构造函数
   Person p3( p2); //调用拷贝构造函数
         //拷贝构造函数吧p2所有的值拷贝到p3
   //注意①:Person p1();//调用默认构造函数不用写括号，编译器会认为是函数的声明(返回值是person函数名是p1)所以什么也不会出现

//2.显示法
   cout<<"\r\n\r\n显示法调用:"<<endl;
   Person p4; //调用默认构造
   Person p5 = Person(10);//调用有参构造
   Person p6 = Person(p5);
   Person p7 = Person(p6);// 把p6的值拷贝给p7 单独Person(p6)不行(注意②)
                 //右边这个东西Person(10);叫匿名对象,他在调用后会被立即析构(匿名的对象只有赋值作用,赋值完就没用了,也没名字)
                 //Person(10);cout<<"aa"<<endl;
   //注意②:不要用拷贝函数来初始化匿名对象。p6是一个拷贝构造函数。Person(10);叫匿名对象
        //Person(p6);//Person(p6) == Person p6 编译器认为是变量声明相当于重定义p6
    cout<<p7.age<<endl;

//2.隐式法:
   cout<<"\r\n\r\n隐式法调用构造函数:"<<endl;
   Person p8 = 10; //有参构造调用 == Person p8 = Person(10);
   Person p9 = p8; //拷贝构造调用 == Person p9 = Person(p8);
   cout<<p8.age<<endl;
   cout<<p9.age<<endl;
   cout<<"\r\n\r\ntest01()执行构造函数(初始化用),构造完后在test01()运行完析构:"<<endl;
}

int main(void)
{
    test01();


    cout<<"\r\n\r\n输入任意字符结束函数\r\n"<<endl;
    cin.get();
    return 0;
}
/**
SUMMERIZE:
1.构造函数的分类:①有参和无参②普通和拷贝
2.构造函数调用:①括号法②显示法③隐式法
-------------------------------------------------------------------
|        |    无参    |   有参               |  拷贝              |
-------------------------------------------------------------------
|括号法  |Person p1   |Person p1(10)         |Person p1(p2)       |
-------------------------------------------------------------------
|显示法  |Person p1   |Person p1=Person(10)  |Person p1=Person(p2)|
-------------------------------------------------------------------
|隐式法  |Person p1   |Person p1=10          |Person p1=p2        |
-------------------------------------------------------------------
一般用括号法来调用结构函数
**/
